a = int(input()) #целое число

if a == 1:
    print('Январь')
elif a == 2:
    print('Февраль')
elif a == 3:
    print('Март')
elif a == 4:
    print('Апрель')
elif a == 5:
    print('Май')
elif a == 6:
    print('Июнь')
elif a == 7:
    print('Июль')
elif a == 8:
    print('Август')
elif a == 9:
    print('Сентябрь')
elif a == 10:
    print('Октябрь')
elif a == 11:
    print('Ноябрь')
elif a == 12:
    print('Декабрь')


"""
В первый день спортсмен пробежал X километров. В каждый последующий день он увеличивал пробег на 15% от предыдущего дня. 
Вам необходимо определить номер дня, в который пробег спортсмена составил не менее Y километров. Само число Y будем поступать на вход программе.
Входные данные
  Программа получает на вход два положительных вещественных числа X и Y (X,Y ≤ 1000).
Выходные данные
  Выведите целое число – номер дня, в который спортсмен пробежал не менее Y километров.
Sample Input 1:
  10 20
    
Sample Output 1:
  6
  
Sample Input 2:
  1 1000
    
Sample Output 2:
  51  
"""
